Catalogs/Region.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Region</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Manager</Name>
					<Comment>Не используется начиная с 30 релиза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Managers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Manager</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.User</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineNumberInUser</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ManagersOfRegions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ManagersOfRegions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ParentRegion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Region</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Region</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Region</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Manager</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Region/Ext/ObjectModule.bsl
Procedure OnWrite(Cancel)
	
	SetPrivilegedMode(True);
	
	// Удалить все записи связанные с этим регионом
	Query = New Query;
	Query.Text = 
		"SELECT
		|	ManagersOfRegions.ParentRegion,
		|	ManagersOfRegions.Region,
		|	ManagersOfRegions.Manager
		|FROM
		|	InformationRegister.ManagersOfRegions AS ManagersOfRegions
		|WHERE
		|	(ManagersOfRegions.ParentRegion = &Ref
		|			OR ManagersOfRegions.Region = &Ref)";
	
	Query.SetParameter("Ref", Ref);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	ManagerForDeletion = InformationRegisters.ManagersOfRegions.CreateRecordManager();
	
	While Selection.Next() Do
		
		FillPropertyValues(ManagerForDeletion, Selection);
		
		ManagerForDeletion.Read();
		
		If ManagerForDeletion.Selected() Then 
			
			Try
				
				ManagerForDeletion.Delete();
				
			Except
			
			EndTry;
			
		EndIf;
		
	EndDo;
	
	// Записать дочерние регионы
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED DISTINCT
		|	Region.Ref AS Region
		|FROM
		|	Catalog.Region AS Region
		|WHERE
		|	Region.Ref IN HIERARCHY(&Ref)
		|
		|ORDER BY
		|	Region HIERARCHY";
	
	Query.SetParameter("Ref", Ref);
	
	Result = Query.Execute();
	
	Selection = Result.Select();
	
	While Selection.Next() Do 
		
		For Each ItemManager In Managers Do 
			
			RecordManager					= InformationRegisters.ManagersOfRegions.CreateRecordManager();
			RecordManager.ParentRegion		= Ref;
			RecordManager.Region			= Selection.Region;
			RecordManager.Manager			= ItemManager.Manager;
			
			RecordManager.Write();
			
		EndDo;
		
	EndDo;
	
	// Перезаписать родительский регион для запуска восстановления дерева регионов
	If ValueIsFilled(Parent) Then 
		
		ParentObject = Parent.GetObject();
		
		ParentObject.Write();
		
	EndIf;
	
EndProcedure
